tap "1password/tap"
tap "azure/functions"
tap "go-rel/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "lindell/multi-gitter"
tap "yoheimuta/protolint"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Cryptographic recipes and primitives for Python
brew "python-cryptography"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Python code formatter
brew "black"
# Linter for YAML files
brew "yamllint"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Core application library for C
brew "glib"
# Protocol definitions and daemon for D-Bus at-spi
brew "at-spi2-core"
# Text processing system for reStructuredText
brew "docutils"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Securely send things from one computer to another
brew "croc"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Command-line client for the Drone continuous integration server
brew "drone-cli"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Multipurpose sniffer/interceptor/logger for switched LAN
brew "ettercap"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Asynchronous event library
brew "libevent"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go programming environment (1.16)
brew "go@1.16"
# Go programming environment (1.17)
brew "go@1.17"
# Open source programming language to build simple/reliable/efficient software
brew "go@1.18"
# Open source programming language to build simple/reliable/efficient software
brew "go@1.19"
# Open source programming language to build simple/reliable/efficient software
brew "go@1.20"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Go version management
brew "goenv"
# Fast linters runner for Go
brew "golangci-lint"
# Image manipulation
brew "netpbm"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Fulltext search engine and column store
brew "groonga"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Network authentication protocol
brew "krb5"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# C library implementing the SSH2 protocol
brew "libssh2"
# Library for USB device access
brew "libusb"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Next-gen compiler infrastructure
brew "llvm"
# Securely transfers data between computers
brew "magic-wormhole"
# Drop-in replacement for MySQL
brew "mariadb"
# Run a Kubernetes cluster locally
brew "minikube"
# Open source relational database management system
brew "mysql-client"
# Utility for managing network connections
brew "netcat"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Draw UML diagrams
brew "plantuml"
# Object-relational database system
brew "postgresql@14"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Cloud native development platform
brew "pulumi"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# QR Code generation
brew "qrencode"
# Utility that provides fast incremental file transfer
brew "rsync"
# Safe, concurrent, practical language
brew "rust"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Tool to build, change, and version infrastructure
brew "terraform"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Graphical network analyzer and capture tool
brew "wireshark"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Azure Functions Core Tools 4.0
brew "azure/functions/azure-functions-core-tools@4"
# Update multiple repositories in bulk
brew "lindell/multi-gitter/multi-gitter"
# Pluggable tool to enforce Protocol Buffer style and conventions
brew "yoheimuta/protolint/protolint"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Application launcher and productivity software
cask "alfred"
# Web browser focusing on privacy
cask "brave-browser"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Universal database tool and SQL client
cask "dbeaver-community"
# Utilities designed to make common development tasks easier
cask "devtoys"
# Voice and text chat software
cask "discord"
# Developer platform
cask "dotnet-sdk"
# Online diagram software
cask "drawio"
# Web browser
cask "firefox"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
# 3D parametric modeler
cask "freecad"
# Free and open-source image editor
cask "gimp"
# App that shows GitHub notifications on the desktop
cask "gitify"
# Git client focusing on productivity
cask "gitkraken"
# Go (golang) IDE
cask "goland"
# Vector graphics editor
cask "inkscape"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Clipboard manager
cask "maccy"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# App to write, plan, collaborate, and get organized
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Programmable solid 3D CAD modeller
cask "openscad"
# IDE for professional Python development
cask "pycharm"
# Geographic Information System
cask "qgis"
# Control your tools with a few keystrokes
cask "raycast"
# .NET IDE
cask "rider"
# Open source virtual/remote desktop application
cask "rustdesk"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Messaging app with a focus on speed and security
cask "telegram"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
vscode "Antyos.openscad"
vscode "AykutSarac.jsoncrack-vscode"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "DAXaholic.vscode-edifact"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "evilz.vscode-reveal"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "GrapeCity.gc-excelviewer"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "IronGeek.vscode-env"
vscode "jebbs.plantuml"
vscode "jock.svg"
vscode "leodevbro.blockman"
vscode "mechatroner.rainbow-csv"
vscode "medo64.render-crlf"
vscode "moalamri.inline-fold"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.test-adapter-converter"
vscode "PKief.material-icon-theme"
vscode "plex.vscode-protolint"
vscode "pulumi.pulumi-lsp-client"
vscode "redhat.ansible"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rogalmic.bash-debug"
vscode "samuelcolvin.jinjahtml"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-german"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "Vue.volar"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"
